[
    {
        "Title": "Quantitative prediction of drug disposition for uridine diphosphate-glucuronosyltransferase substrates using humanized mice.",
        "Authors": "Miyake Taiji, Fujita Yuito, Hirabayashi Manabu, Komiyama Natsuko, Morita Keiichi, Tachibana Tatsuhiko, Terao Kimio",
        "Journal Information": {
            "title": "Drug metabolism and disposition: the biological fate of chemicals",
            "volume": "53",
            "issue": "4",
            "pub_date": "2025 Feb 10"
        },
        "DOI": "10.1016/j.dmd.2025.100050",
        "Abstract": "Drug clearance and drug-drug interactions are essential for pharmacokinetic assessment. However, current in vitro systems and animal scale-up approaches often fail to accurately predict drug disposition mediated by metabolizing enzymes, especially uridine diphosphate-glucuronosyltransferase (UGT). This study demonstrates how UGT-mediated drug disposition in humans can be predicted using hu-PXB mice (cDNA-uPA/severe combined immunodeficiency (SCID) mice transplanted with human-derived hepatocytes). To estimate human hepatic intrinsic clearance (CL",
        "FullTextAvailable": false
    },
    {
        "Title": "Thonningianin A ameliorates acetaminophen-induced liver injury by activating GPX4 and modulating endoplasmic reticulum stress.",
        "Authors": "Lai Shanglei, Ye Yingyan, Ding Qinchao, Hu Xiaokai, Fu Ai, Wu Lan, Cao Wenjing, Liu Qingsheng, Dou Xiaobing, Qi Xuchen",
        "Journal Information": {
            "title": "Frontiers in pharmacology",
            "volume": "16",
            "pub_date": "2025"
        },
        "DOI": "10.1016/j.apsb.2020.06.016",
        "Abstract": "INTRODUCTION: Acetaminophen (APAP) is widely used as an analgesic and antipyretic. However overdose APAP can lead to acute liver injury (ALI), representing a significant challenge for public health due to limited treatment options. Current research highlights the need for safer and more effective therapies for APAP-induced liver injury, especially those that target oxidative and endoplasmic reticulum (ER) stress pathways. This study investigates the protective effects of Thonningianin A (TA), a flavonoid compound derived from \n\nMETHODS: The experimental design involved administering TA at doses of 20 mg/kg and 40 mg/kg to C57BL/6 mice prior to inducing hepatotoxicity with APAP.\n\nRESULTS AND DISCUSSION: TA treatment significantly lowered plasma ALT and AST levels, inhibited the production of inflammatory cytokines, and reduced oxidative stress markers in liver tissues. Furthermore, TA modulated apoptosis-related proteins by increasing BCL-2 expression while decreasing CHOP and BAX levels. It alleviated endoplasmic reticulum (ER) stress by downregulating GRP78, p-PERK, and ATF4. Notably, liver-specific GPX4 knockdown, achieved through AAV-8-mediated shRNA delivery, abolished the hepatoprotective effects of TA, underscoring GPX4's essential role in mediating TA-induced hepatoprotection. These findings suggest TA as a promising therapeutic agent in managing APAP-induced liver injury, with its unique action on both oxidative and ER stress pathways contributing to its hepatoprotective efficacy.",
        "FullTextAvailable": true
    },
    {
        "Error": "Error: 429 - Too Many Requests"
    },
    {
        "Error": "Error: 429 - Too Many Requests"
    },
    {
        "Error": "Error: 429 - Too Many Requests"
    }
]